
using Grayscale.P056Syugoron.I250Struct;


namespace Grayscale.P693_ShogiGui___.L___080_Shape
{
    public interface Shape_BtnMasu
    {

        /// <summary>
        /// ------------------------------------------------------------------------------------------------------------------------
        /// 座標
        /// ------------------------------------------------------------------------------------------------------------------------
        /// 
        ///         升目の位置。
        /// 
        /// </summary>
        SyElement Zahyo { get; set; }


    }
}


