
namespace Grayscale.P252_KifuwKuukan.L500____Word
{
    public enum KifuwarabeKuukan24
    {


        /// <summary>
        /// （空間１）　元交差　　“上”筋　　　１～　　９
        /// </summary>
        k1_元交差_上,

        /// <summary>
        /// （空間２）　元交差　　“引”筋　　１０～　１８
        /// </summary>
        k2_元交差_引,

        /// <summary>
        /// （空間３）　元交差　　“滑”筋　　１９～　２７
        /// </summary>
        k3_元交差_滑,

        /// <summary>
        /// （空間４）　元交差　　“射”筋　　２８～　３６
        /// </summary>
        k4_元交差_射,

        /// <summary>
        /// （空間５）奇角交差　　“昇”筋　　３７～　４３
        /// </summary>
        k5_奇角交差_昇,

        /// <summary>
        /// （空間６）奇角交差　　“降”筋　　４４～　５０
        /// </summary>
        k6_奇角交差_降,

        /// <summary>
        /// （空間７）奇角交差　　“沈”筋　　５１～　５７
        /// </summary>
        k7_奇角交差_沈,

        /// <summary>
        /// （空間８）奇角交差　　“浮”筋　　５８～　６４
        /// </summary>
        k8_奇角交差_浮,

        /// <summary>
        /// （空間９）偶角交差　　“昇”筋　　６５～　７２
        /// </summary>
        k9_偶角交差_昇,

        /// <summary>
        /// （空間10）偶角交差　　“降”筋　　７３～　８０
        /// </summary>
        k10_偶角交差_降,

        /// <summary>
        /// （空間11）偶角交差　　“沈”筋　　８１～　８８
        /// </summary>
        k11_偶角交差_沈,

        /// <summary>
        /// （空間12）偶角交差　　“浮”筋　　８９～　９６
        /// </summary>
        k12_偶角交差_浮,

        /// <summary>
        /// （空間５）金桂交差　　“駆”筋　　９７～１０２
        /// </summary>
        k13_金桂交差_駆,

        /// <summary>
        /// （空間６）金桂交差　　“跳”筋　１１５～１２０
        /// </summary>
        k14_金桂交差_跳,

        /// <summary>
        /// （空間７）銀桂交差　　“駆”筋　１２１～１２５
        /// </summary>
        k15_銀桂交差_駆,

        /// <summary>
        /// （空間８）銀桂交差　　“跳”筋　１３６～１４０
        /// </summary>
        k16_銀桂交差_跳,

        /// <summary>
        /// （空間９）擦金桂交差　“駆”筋　１４１～１４５
        /// </summary>
        k17_擦金桂交差_駆,

        /// <summary>
        /// （空間10）擦金桂交差　“跳”筋　１５６～１６０
        /// </summary>
        k18_擦金桂交差_跳,

        /// <summary>
        /// （空間11）擦銀桂交差　“駆”筋　１６１～１６５
        /// </summary>
        k19_擦銀桂交差_駆,

        /// <summary>
        /// （空間12）擦銀桂交差　“跳”筋　１７６～１８０
        /// </summary>
        k20_擦銀桂交差_跳,

        /// <summary>
        /// （空間21）歩打面　　　“上”面　１８１
        /// </summary>
        k21_歩打面,

        /// <summary>
        /// （空間22）香打面　　　“上”面　１８３
        /// </summary>
        k22_香打面,

        /// <summary>
        /// （空間23）桂打面　　　“上”面　１８５
        /// </summary>
        k23_桂打面,

        /// <summary>
        /// （空間24）全打面　　　　　　　　１８７
        /// </summary>
        k24_全打面,
    }
}
