
namespace Grayscale.P209KifuJsa.L500Word
{

    /// <summary>
    /// ************************************************************************************************************************
    /// 成、不成です。
    /// ************************************************************************************************************************
    /// </summary>
    public enum NariNarazu
    {
        
        /// <summary>
        /// 成
        /// </summary>
        Nari,

        /// <summary>
        /// 不成
        /// </summary>
        Narazu,

        /// <summary>
        /// 現状維持
        /// </summary>
        CTRL_SONOMAMA
    }
}
