
namespace Grayscale.P209_KifuJsa____.L500____Word
{

    /// <summary>
    /// ************************************************************************************************************************
    /// “打”表示。必ずしも、持ち駒を打つタイミングとは一致しません。
    /// ************************************************************************************************************************
    /// </summary>
    public enum DaHyoji
    {

        /// <summary>
        /// “打”表示あり
        /// </summary>
        Visible,

        /// <summary>
        /// “打”非表記
        /// </summary>
        No_Print

    }

}
