
namespace Grayscale.P693_ShogiGui___.L___125_Scene
{

    /// <summary>
    /// ************************************************************************************************************************
    /// 指す所作（１）　駒をつまみたい
    /// ************************************************************************************************************************
    /// 
    ///         動かしたい駒を選ぶフェーズです。
    /// 
    /// </summary>
    public enum SceneName
    {
        Ignore,
        SceneA_1Taikyoku,
        SceneB_1TumamitaiKoma,
        SceneB_2OkuKoma,
        SceneB_3ErabuNaruNaranai
    }
}
